# Задача 30:  Заполните массив элементами арифметической прогрессии. Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.





# Задача 32: Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)

# def new_list(size,min_val,max_val):
#     import random
#     return [random.randint(min_val,max_val) for _ in range(size)]


# def serch_index(list_serch,n,n1):
#         for i in range(len(list_serch)):
#             if n <= list_serch[i] <= n1 :
#                 print(f'{list_serch[i]} индекс {i}')
        







# list_1 = new_list(10,1,10)
# result = serch_index(list_1,2,6)
# print(result)